{
  "people": [
      
    {
      "name": "Sam Bell",
      "avatar": "https://www.gravatar.com/avatar/f5fe63e7ab9414080068bd761fbd0542",
      "bio": "Sam is co-founder of digital agency, Copia Digital. He and his team build websites and web applications for asset managers and companies listed on the London Stock Exchange, helping them report on performance to their investors. They also run a side project called ChartBlocks, an online chart building tool that makes it easy to embed charts into your website or social media.",
      "role": "Sam manages registration, sponsors, exhibits and volunteers for the conference.",
      "links": {
        "websites": [
          {
            "title": "Copia Digital",
            "url": "http://www.copiadigital.co.uk"
          },
          {
            "title": "ChartBlocks",
            "url": "http://www.chartblocks.com/"
          }
        ],
        "twitter": "https://twitter.com/_samdb",
        "github": "http://github.com/samdb",
        "linkedin": "https://uk.linkedin.com/in/bellsam/"
      }
    },
    {
      "name": "Rosie Bell",
      "avatar": "/images/organisers/rosie1.jpg",
      "bio": "Rosie joined the team in 2016 to help with the increasing workload as the conference grew in size.",
      "role": "Rosie looks after the delegate services, answering any questions our attendees have in the lead up to the conference. She also manages exhibits, volunteers, and sponsor sales.",
      "links": {
        "twitter": "http://twitter.com/RosieBe10530628"
      }
    },
    {
      "name": "Paul Berberich",
      "avatar": "https://secure.gravatar.com/avatar/737561f4dd2eb1285064fcd390e75a0e",
      "bio": "Paul brings many years of customer service experience to his role, courtesy of the many different types of jobs he’s had over the years. Since joining the team he’s learned web development which he uses to keep this web site up to date, as well as some personal projects. When not planning or running one of our conferences, you can find him performing with his local improv group or running his weekly game night.",
      "role": "Paul is an event coordinator and manages the venue, speakers, scholarships, socials and vendors.",
      "links": {
        "twitter": "http://twitter.com/paulberb",
        "github": "http://github.com/paulberb"
      }
    }
  ]
}
