{
    "days": [{
        "schedule-wednesday": null,
        "name": "Wednesday 16th February 2022",
        "description": "<p>PHP UK Conference is pleased to bring to you <b>two</b> options for a full day of training on Wednesday, 16th February 2022, a day before the conference.</p><p>All course options are a full day (9am-5pm) of hands on immersive training with top professional trainers. Tickets include breakfast, lunch and coffee breaks. Please bring your laptop; power and wifi will be available.</p><p>**Please Note - an additional ticket is required to attend the workshop day.</p>",
        "slots": [{
            "time": "8.00",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "Grubstreet Author @ The Brewery",
                "title": "Registration and Refreshments",
                "slug": null,
                "speaker": null,
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "description": "Please bring a copy of your ticket either printed or on a mobile device. Light refreshments will be served."
            }]
        }, {
            "time": "09.00",
            "slottype": "workshop",
            "tracks": [{
                "colspan": 1,
                "name": "Workshop I",
                "speaker": "Mark Bradley",
                "slug": "markbradley",
                "title": "Introduction to Test Driven Development Workshop",
                "location": "Grubstreet Author<br>The Brewery",
                "id": "workshopi",
                "description": "This workshop introduces the concepts of Test Driven Development then backs them up with group and individual practical sessions. The workshop will cover:<ul><li>What is TDD</li><li>Why should you use TDD</li><li>How to use TDD</li><li>The Testing Pyramid</li><li>Test Doubles</li></ul><br>Practicals will start with implementing simple Abstract Data Types and work up to a small complex systems requiring test doubles. The workshop will use PHPUnit and Mockery but concepts can easily be transferred to other testing and mocking frameworks (Codeception, PHPSpec, Phake or Prophercy)."
            }, {
                "colspan": 1,
                "name": "Workshop II",
                "speaker": "",
                "slug": "",
                "title": "",
                "location": " ",
                "id": "workshopii",
                "description": ""
            }]
        }, {
            "time": "12.30",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "Grubstreet Author @ The Brewery",
                "title": "Lunch",
                "description": "A 3 course buffet lunch will be served where you will also be able to network with fellow delegates."
            }]
        }, {
            "time": "13.30",
            "slottype": null,
            "tracks": [{
                "colspan": 1,
                "name": "Workshop I",
                "title": "Continued: Introduction to Test Driven Development Workshop",
                "speaker": "Mark Bradley",
                "slug": "markbradley",
                "location": "Grubstreet Author<br>The Brewery",
                "id": "workshopi",
                "description": "This workshop introduces the concepts of Test Driven Development then backs them up with group and individual practical sessions. The workshop will cover:<ul><li>What is TDD</li><li>Why should you use TDD</li><li>How to use TDD</li><li>The Testing Pyramid</li><li>Test Doubles</li></ul><br>Practicals will start with implementing simple Abstract Data Types and work up to a small complex systems requiring test doubles. The workshop will use PHPUnit and Mockery but concepts can easily be transferred to other testing and mocking frameworks (Codeception, PHPSpec, Phake or Prophercy)."
            }, {
                "colspan": 1,
                "name": "Workshop II",
                "title": "",
                "speaker": "",
                "slug": "",
                "location": " ",
                "id": "workshopii",
                "description": ""
            }]
        }, {
            "time": "18.00",
            "slottype": "break",
            "tracks": [{ 
                "colspan": 2,
                "name": "Pre-Conference Social",
                "location": "Grubstreet Author @ The Brewery",
                "title": "Pre-Conference Social",
                "description": "Join us in the Grubstreet Author at the Brewery with the PHP London user group for a pre-conference social  . <a href=\"/socials\">More info &raquo;</a>"
            }]
        }]
    }, {
        "schedule-thursday": null,
        "name": "Thursday 17th February 2022",
        "description": "<p>Thursday is the first day of the main conference. Things will kick off with a morning keynote followed by two tracks of talks throughout the day. During each time slot you'll be able to choose which of the two tracks you would like to attend. There will be 3 cake & coffee breaks, a 3 course lunch, and rolling tea, coffee and soft drinks included. The day finishes with a keynote before we move on to the main conference social.</p>",
        "slots": [{
            "time": "08.00",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "The Brewery Foyer",
                "title": "Registration and Refreshments",
                "description": "Please bring a copy of your ticket either printed or on a mobile device. Light refreshments will be served in the exhibition hall where you will also be able to network with fellow delegates and our sponsors."
            }]
        }, {
            "time": "09.00",
            "slottype": "keynote",
            "tracks": [{
                "colspan": 2,
                "location": "Platform.sh Track - Porter Tun",
                "title": "Never stop learning, or how curiosity and cross pollination drives innovation",
                "name": "Keynote",
                "slug": "paulinevos",
                "speaker": "Pauline Vos",
                "handle": "dragonmantank",
                "company": null,
                "photo": null,
                "bio": null,
                "description": "Software developers all know: continual learning is part of the job. And that's what so many of us love about it. Innovation is constant, and it's an exciting challenge to keep up with so many new technologies. But where do all these new concepts, frameworks, and patterns come from? Let’s take a journey through the history of innovation to explore how different worlds collided to inspire new, radical ideas. Let’s discover how cross-pollination has helped our community grow into what it is now, and can help us think of new ways to solve complex problems. Join us for a session of inspirational stories that illustrate how cross-pollination has helped form some of history’s most profound innovations, and will hopefully inspire you to conjure up your own radical new ideas."
             }]
        }, {
            "time": "09.30",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "King George",
                "title": "Refreshment break",
                "description": "Light refreshments will be served in the exhibition hall where you will also be able to network with fellow delegates and our sponsors."
            }]
        }, {
            "time": "10.00",
            "slottype": "talks",
            "tracks": [{
                "location": "Platform.sh Track - Porter Tun",
                "title": "What's New in PHP 8.1",
                "name": "Talk",
                "slug": "derickrethans",
                "speaker": "Derick Rethans",
                "level": "Intermediate",
                "description": "During this presentation, we are going to look at the new features that were introduced in PHP 8.1. Join me to have a look at how the type system is strengthened with Enumerations and “never”, Fibers, a new closure syntax, the First Class Callable Syntax, intersection types, and other new smaller features. At the end you will have a good understanding about all the new and exciting features that are part of the PHP 8.1 release."
            }, {
                "location": "GoodLord Track - Queen Charlotte",
                "title": "Embrace the pitfalls (Our stop start journey to Change)",
                "name": "Talk",
                "slug": "stacycashmore",
                "speaker": "Stacy Cashmore",
                "level": "All",
                "description": "As developers, we want to work in a modern way, to get fast feedback on what we are building to make sure that we are building the right things in the right way. However, many companies are still at the start of their journey. Things take longer than we would like to get moving, sometimes change can seem to happen at a glacial pace and whilst you are ready to try and run, others are finding their feet - or even digging in their heels!In this talk, Stacy will go over some of the pitfalls that have happened to her, and the lessons that she has learned from them. Unfortunately, there are no magic solutions to make the problems go away, but hopefully, you can look at the mistakes she has made and go away to make your own new ones to learn from!"
            }]
        }, {
            "time": "11.15",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "King George",
                "title": "Room change"
            }]
        }, {
            "time": "11.15",
            "slottype": "talks",
            "tracks": [{
                "location": "Platform.sh Track - Porter Tun",
                "title": "Container-native without k8s: PHP in ECS on AWS",
                "name": "Talk",
                "slug": "ianlittman",
                "speaker": "Ian Littman",
                "handle": null,
                "photo": null,
                "bio": null,
                "level": "Intermediate",
                "description": "When building Covie, I got to pick our tech stack, including where and how to run it. The choice was containerized on ECS with AWS, starting on Fargate…and so far, so good. We'll walk through how to set this stack up, with some tips and tricks along the way."
            }, {
                "location": "GoodLord Track - Queen Charlotte",
                "title": "Improve your API with OpenAPI",
                "name": "Talk",
                "slug": "roballen",
                "speaker": "Rob Allen",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "All",
                "description": "OpenAPI is the standard way to describe your HTTP API, adopted by most modern APIs. With the spec at the centre of your workflow, you can improve the quality of your API and development practices, and make integrations painless. With standardisation comes tooling and in this session, I will show you to leverage this to your advantage. We’ll cover what OpenAPI is, why it’s interesting and then how to use it. We will also look at how the OpenAPI specification enables you to create documentation, use mock servers and improve the robustness of our API with validation. This session is ideal for anyone who wants to write an API specification once and use it everywhere."   
            }]
        }, {
            "time": "12.15",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "King George",
                "title": "Lunch",
                "description": "A 3 course buffet lunch will be served in the exhibition hall where you will also be able to network with fellow delegates and our sponsors.\n"
            }]
        }, {
            "time": "13.30",
            "slottype": "talks",
            "tracks": [{
                "location": "Platform.sh Track - Porter Tun",
                "title": "Technically speaking: Improve Your Code With Documentation",
                "name": "Talk",
                "subtitle": null,
                "slug": "alexandrawhite",
                "speaker": "Alexandra White",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "All",
                "description": "Well written instructions, informative comments throughout code, clearly scripted screencasts, and smart information architecture can take complex code and make it accessible to new developers. In the age of code sharing, this can be imperative to teaching the next generation of developers, passing along your code to successors, and help you better understand your own work."
            }, {
                "location": "GoodLord Track - Queen Charlotte",
                "title": "Going serverless with PHP and Bref.sh (2 Hour Tutorial)",
                "name": "Tutorial",
                "slug": "mikelehan",
                "speaker": "Mike Lehan",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "Intermediate",
                "description": "Learn how to build and deploy serverless PHP applications. During the workshop we'll explore Bref, a way to run PHP functions and HTTP APIs on AWS Lambda. We'll deploy and play with a pre-built application, as well as explore how you can migrate your existing workloads. If we truly want to do away with managing infrastructure we also want to understand how to manage data serverless. AWS DynamoDB is a highly scalable document/key-value store, which offers a lot of flexibility for developers with a steep learning curve. We'll cover the basics of this platform, and set you up to learn and develop more, whilst avoiding potential pitfalls that might hurt your production applications."
            }]
        }, {
            "time": "14.30",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": null,
                "title": "Room change"
            }]
        }, {
            "time": "14.45",
            "slottype": "talks",
            "tracks": [{
                "location": "Platform.sh Track - Porter Tun",
                "title": "Make Me a JS Object Model",
                "name": "Talk",
                "subtitle": null,
                "slug": "milkokosturkov",
                "speaker": "Milko Kosturkov",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "Intermediate",
                "description": "Confused by JavaScript’s weird object model? Getting it, but still missing some details? You’re a JS master and you want to see your favorite object model in PHP land? That’s what we’ll do! We’ll dig into the JS object model and try to recreate it using PHP magic! We will explore the JavaScript object model and recreate it in PHP. In the process we will dig into some JS details that are often unknown or less-understood. With PHP we will use well known features, which, however, are rarely used for the true flexibility they provide. We will look into some weird ideas of how things can be done (not necessarily good ones, but let’s have some evil fun."
                
            }, {
                "location": "GoodLord Track - Queen Charlotte",
                "title": "Continued: Going serverless with PHP and Bref.sh (2 Hour Tutorial)",
                "name": "Tutorial",
                "slug": "mikelehan",
                "speaker": "Mike Lehan",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "Intermediate",
                "description": "Learn how to build and deploy serverless PHP applications. During the workshop we'll explore Bref, a way to run PHP functions and HTTP APIs on AWS Lambda. We'll deploy and play with a pre-built application, as well as explore how you can migrate your existing workloads.If we truly want to do away with managing infrastructure we also want to understand how to manage data serverless. AWS DynamoDB is a highly scalable document/key-value store, which offers a lot of flexibility for developers with a steep learning curve. We'll cover the basics of this platform, and set you up to learn and develop more, whilst avoiding potential pitfalls that might hurt your production applications."
            }]
        }, {
            "time": "15.45",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "King George",
                "title": "Refreshment break",
                "description": "Light refreshments will be served in the exhibition hall where you will also be able to network with fellow delegates and our sponsors.\n"
            }]
        }, {
            "time": "16:15",
            "slottype": "keynote",
            "tracks": [{
                "colspan": 2,
                "location": "Platform.sh Track - Porter Tun",
                "title": "Passwords are so 1990",
                "name": "Keynote",
                "slug": "sambellen",
                "speaker": "Sam Bellen",
                "level": "All",
                "description": "In this talk I will give a quick overview of the past, present and future of authentication. From basic authentication to passwordless biometric authentication using the web authentication API, and everything in between. The audience does not need any specific knowledge as this talk will not go into implementation details, but aims to give a view of what’s to come in terms of authentication."

                
            }]
        }, {
            "time": "17.00",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "King George &amp; Queen Charlotte",
                "title": "Mid Conference Social",
                "description": "The conference social is open to all conference attendees and gives you a chance to relax and meet other delegates after a big day of learning. <a href=\"/socials\">More info &raquo;</a>"
            }]
        }]
    }, {
        "schedule-friday": null,
        "name": "Friday 18th February 2022",
        "description": "<p>Friday continues with the second day of the main conference. Again, you will be able to attend a morning keynote followed by two talk slots throughout the day. During each talk slot you'll have the choice between two different tracks. There will be 3 cake &amp; coffee breaks, a 3 course lunch, and rolling tea, coffee and soft drinks included. The conference will close on Friday with a final featured keynote, a prize raffle from our sponsors, and then on to the evening <a href=\"/socials\">post-conference social</a>.</p>\n",
        "slots": [{
            "time": "08.00",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "Brewery Foyer & King George",
                "title": "Registration and Refreshments",
                "description": "Please bring a copy of your ticket either printed or on a mobile device. Light refreshments will be served in the exhibition hall where you will also be able to network with fellow delegates and our sponsors."
            }]
        }, {
            "time": "09.00",
            "slottype": "keynote",
            "tracks": [{
                "colspan": 2,
                "location": "Platform.sh Track - Porter Tun",
                "title": "Open Source is Good for Business ",
                "name": "Keynote",
                "slug":  "lornajanemitchell",
                "speaker": "Lorna Jane Mitchell",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "description": "We sometimes talk about businesses contributing to open source as a philanthropic act, it’s much more than that. Business is an important part of a healthy open source ecosystem, and the benefits flow in both directions. In this talk we’ll discuss how open source participation can be rewarding for staff and for the bottom line. We’ll cover ways to get started without impacting delivery of the projects you’re already working on, ways to pitch this to higher-ups, and times when it might be better to ask for forgiveness rather than permission. PHP is in every organisation, and it’s a great example of a thriving Open Source ecosystem. This talk is for everyone who wants to see a bright future for technology, open source, individuals and businesses alike."
            }]
        }, {
            "time": "09.30",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "King George",
                "title": "Refreshment break",
                "description": "Light refreshments will be served in the exhibition hall where you will also be able to network with fellow delegates and our sponsors."
            }]
        }, {
            "time": "10.00",
            "slottype": "talks",
            "tracks": [{
                "location": "Platform.sh Track - Porter Tun",
                "title": "PHP Fibers",
                "name": "Talk",
                "slug": "milkokosturkov",
                "speaker": "Milko Kosturkov",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "Advanced",
                "description": "In PHP 8.1 we welcome a new built-in feature - Fibers. Fibers give us the stepping stone for more sane (looking) and modern async programming. But on their own, they don’t seem to offer much, so how does it work? Well, we’re gonna do our own async Proof-Of-Concept framework using them and find out!"
            }, {
                "location": "GoodLord Track - Queen Charlotte",
                "title": "Managing from 1 to 1 million Kubernetes Clusters",
                "name": "Talk",
                "slug": "bastianhofmann",
                "speaker": "Bastian Hofmann",
                "handle": null,
                "photo": null,
                "bio": null,
                "level": "Intermediate",
                "description": "Nowadays Kubernetes can run anywhere. On a developer machine, on premise, in a public cloud as well as on the edge. The common Kubernetes API makes it faster and easier to deploy workloads and manage network connectivity, storage, load balancing, security or service discovery. This allows you to leverage the best of all worlds and combine on-premise, private and public clouds to a hybrid environment that distributes your workloads as efficiently as possible. On the other hand, you quickly end up running not only one or two clusters, but dozens, or in edge and IOT scenarios even thousands or millions. In this talk I will show how Rancher can help you to successful provision, manage and monitor these clusters, as well as the workloads running in them, regardless of the underlying infrastructure."
            }]
        }, {
            "time": "11.15",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": null,
                "title": "Room change"
            }]
        }, {
            "time": "11.15",
            "slottype": "talks",
            "tracks": [{
                "location": "Platform.sh Track - Porter Tun",
                "title": "Technical scoping like a pro to build the right thing & be a superhero",
                "name": "Talk",
                "slug": "chandeepkhosa",
                "speaker": "Chandeep Khosa",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "All",
                "description": "Over the past 16 years as a web developer I've seen my fair share of car crashes in projects. I've been lucky to move up the ranks to Senior Dev, Lead Dev, Tech Lead and now Solutions Architect. I'll be sharing some of the things I wish I knew to avoid the problems, stresses & late nights and deliver successful technical projects and delight your clients. In this talk I'll share how I like to take some time early in the project to do some technical analysis including changing roles from Architect, to Scout, to Planner. This includes working closely with UX/UI designers, PMs and clients (when relevant) to get as much knowledge from them and make some requests for things they might be able to help with. This leads to reviewing and creating user stories with a wider team, breaking down tasks, planning dependencies between tasks and pre-empting risks. I’ll also cover planning tests, delegating tasks, communicating with other developers, project managers and clients and several other things that ultimately help you to look like a superhero."

            }, {
                "location": "GoodLord Track - Queen Charlotte",
                "title": "Hop on the PHP Blockchain rocket to the MOON!",
                "name": "Talk",
                "slug": "drishtijain",
                "speaker": "Drishti Jain",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "All",
                "description": "Blockchain is innovative and guarantees the fidelity and security of data and generates trust without the need for a trusted third party. The core lies in its ability to be secure, eliminate trust, being reliable and decentralized. It gives ‘POWER’ to all equally and creates transparency. In this talk I will show how you too can transform and become a blockchain developer with PHP. We'll talk about Digital Signature transaction encryption, avoiding counterfeit using node agreement. The core basis of blockchain and cryptography lies in the Cryptographic hash function. I will showcase what it is, how to choose and develop the hash function and all about cryptography. I’ll also cover end-of-chain ambiguity, blockchain mining and mining pools. So, gear up and fuel your excitement for blockchain using PHP through my talk!"
            }]
        }, {
            "time": "12.15",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "King George",
                "title": "Lunch",
                "description": "A 3 course buffet lunch will be served in the exhibition hall where you will also be able to network with fellow delegates and our sponsors.\n"
            }]
        }, {
            "time": "13.30",
            "slottype": "talks",
            "tracks": [{
                "location": "Platform.sh Track - Porter Tun",
                "title": "Practical Advanced Static Analysis",
                "name": "Talk",
                "slug": "daveliddament",
                "speaker": "Dave Liddament",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "Intermediate",
                "description": "All developers know that bugs are bad and finding them can be difficult. The good news is tools to help us find and prevent bugs are becoming more powerful… Modern static analysis tools (e.g. IDEs like PHPStorm and tools like Psalm, Phan and PHPStan) are far more advanced than their predecessors. They can find a whole range of bugs whilst keeping the false positive rate low.This talk introduces more advanced static analysis. It will show the kinds of bugs that the more advanced static analysis tools can find. We'll then look how they can be added to your current development work flow. We'll finally look at how we can write our code in such a way to get the most out of static analysis."
            },{
                "location": "GoodLord Track - Queen Charlotte",
                "title": "Levelling Up Your Web Scraping Game",
                "name": "Talk",
                "slug": "ianlittman",
                "speaker": "Ian Littman",
                "handle": "",
                "company": "",
                "photo": "",
                "bio": "",
                "level": "Intermediate",
                "description": "Sometimes you need to get information from a website or mobile app and there isn’t a clean, well-documented API providing it. Enter web scraping. We’ll go through some tips and tricks to speed you along your journey; scraping is a big part of what Covie does so we know a thing or two about it."
            }]
        }, {
            "time": "14.30",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": null,
                "title": "Room change"
            }]
        }, {
            "time": "14.45",
            "slottype": "talks",
            "tracks": [{
                "location": "Platform.sh Track - Porter Tun",
                "title": "From Betamax to VCR: harden your API integration testing",
                "name": "Talk",
                "speaker": "James Seconde",
                "slug": "jamesseconde",
                "level": "Intermediate",
                "description":"This talk comes from inheriting a complete, widely used open source PHP API library. It’s complete in that it has a full test suite, but problems arise from the approach of mocking JSON responses to assert tests on. The responses have to be maintained, and that can inevitably lead to false positives if the underlying API changes without the maintainer being notified. You can be clever and use a git submodule to bring in a standardised response that can be used by the same library in other languages, but then you need someone to maintain that across various departments of engineering. A chat with my colleague who is the resident Ruby library developer revealed that VCR has been used across the Ruby world for years. Why hadn’t I come across this approach, after years of PHP development (and specifically API testing work)? My passion is for expressive, self-documenting code. After all, it’s what I do in my current role: I advocate for the PHP developer community, and PHP developers are the ones that I maintain that library for. VCR plus integration with the PEST testing framework gives that readability we should strive for - it helps developers understand what your code is doing with responses. But the biggest thing here is the ability to trigger a record when something upstream changes. If someone pushes out a change to the OpenAPI specification, you can get a webhook to trigger a build on your library. The response is different, something has been removed or added, and your test suite fails. A test written in PEST, so highly readable. If you’re a new developer on the project, you’re being told what needs fixing, and that is a story that needs telling."

            }, {
                "location": "GoodLord Track - Queen Charlotte",
                "title": "How to really work as a team- from sleepy to strong pair programming",
                "name": "Talk",
                "slug": "stacycashmore",
                "speaker": "Stacy Cashmore",
                "level": "All",
                "description": "So many people think that pair programming is a boring waste of time and effort. I'm here to explain how our team made it work, and what benefits we got out of it! I love working in a team, bouncing ideas off each other and using our combined strengths to produce something that as individuals we wouldn't be able to come up with. One way I like to do this is pair programming. But, when I talk to people about this, I often get told it's a waste of time. That it's about one person working hard whilst the other looks on, superfluous to the process. And let's face it, most of us have experienced this when trying it out! But I'm going to show you how we went from this sleepy type of pair programming to being super productive when working with multiple developers at one machine! Not the one person working, one person staring into space type of pair programming, but actually providing value to each other, making the extra effort worthwhile, and bringing extra benefits to the team as a whole."
            }]
        }, {
            "time": "15.45",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "location": "King George",
                "title": "Refreshment break",
                "description": "Light refreshments will be served in the exhibition hall where you will also be able to network with fellow delegates and our sponsors.\n"
            }]
        }, {
            "time": "16.15",
            "slottype": "keynote",
            "tracks": [{
                "colspan": 2,
                "location": "Platform.sh Track - Porter Tun",
                "title": "Leading in Tech",
                "name": "Keynote",
                "slug": "michaelcullum",
                "speaker": "Michael Cullum",
                "handle": null,
                "company": null,
                "photo": null,
                "bio": null,
                "level": "All",
                "description": "In tech there are a lot of different people who 'lead' on different things. A mentor when you're joining a new company showing you the ropes of what exists and why thing are the way they are. A CTO responsible for your team's engineering function. A principal engineer working with you on some of the most complex problems. A team's tech lead who might organise some projects and focus on the team's technical direction & execution. An individual in the community who publishes content you find helpful or is responsible for a library you use. An engineering manager who supports you through your development. In this talk we'll look at what good leadership in tech really means, the different kinds of leaders, how to become a leader in tech, and what great leaders can give you."
            }]
        }, {
            "time": "17.00",
            "slottype": "break",
            "tracks": [{
                "colspan": 2,
                "title": "Post Conference Social",
                "location": "The Clerkenwell Grind",
                "description": "The conference social is open to all conference attendees and gives you a chance to relax and meet other delegates after a big day of learning. <a href=\"/socials\">More details &raquo;</a>\n"
            }]
        }]
    }]
}
