[
  {
    "name": "Tim Huijzers",
    "slug": "timhuijzers",
    "twitter": "Dragem",
    "company": "Drukwerkdeal",
    "photo": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/30990/profile300.jpg",
    "bio": "Professional Developer for more than 8 years now, Worked at Drukwerkdeal.nl for more than 5 of them. Does a lot with financial systems and advocate for good architecture. Like to be called a Developer and not a Programmer! Also Founder of DeventerPHP user group. Next to developing for money Tim likes to develop for his other 2 hobbies, Beer and Board games. No wonder some of his talks are about one or the other."
  },
  {
    "name": "Antonio Peric-Mazar",
    "slug": "antoniopericmazar",
    "twitter": "antonioperic",
    "company": ":ocastic",
    "photo": "https://secure.gravatar.com/avatar/29db221e8a59b06c9180725ec8ac1e75?s=500",
    "bio": "Antonio Perić-Mažar is CEO at Locastic digital agency, based in beautiful Croatian city called Split. Their main focus is to build complex mobile and web platforms for different clients that range from startups to enterprise companies from all over the globe."

  },
  {
    "name": "Mark Bradley",
    "handle": "markbradley",
    "twitter": "braddle",
    "company": "Sainsbury's",
    "photo": "/images/2020/speakers/markbradley.jpg",
    "bio": "Mark Bradley is a Principal Software Engineer from London, currently working for Sainsbury’s. Working in the industry for over 10 years Mark has developed a passion for supporting and mentoring his peers and has more recently been working with the apprentice programme at Sainsbury’s alongside his day job. A keen protagonist of Test Driven Development, he launched his own screen cast, ‘Testing All the Things’ in the Spring, to teach the wider community how to practice Test Driven Development and Automated Testing.<br><br>Mark is a keen cyclist, who enjoys quiet evenings in the pub playing board games and spending time with his wife and three children."
  },
  {
    "name": "Bastian Hofmann",
    "slug": "bastianhofmann",
    "twitter": "BastianHofmann",
    "company": "SysEleven",
    "photo": "https://secure.gravatar.com/avatar/3a3f9c32c9e5a4c2970befd97d52285b?s=500",
    "bio": "Bastian is a System Engineer at SysEleven, a full-service hosting company, where he focuses on bringing the power of Kubernetes to its customers. Before that he was caring about performance, monitoring, web-security and developer productivity at ResearchGate, the leading social network for researchers and scientists. When he is not developing stuff or looking at graphs, he likes to cycle, do Yoga, go to beer gardens and frequently speaks at international conferences on Kubernetes, software architecture and scaling web applications."
  }
]
