[{
  "name": "Bastian Hofmann",
  "slug": "bastianhofmann",
  "twitter": "BastianHofmann",
  "company": "SUSE",
  "photo": "/images/2023/bastian-hofmann.png",
  "bio": "Bastian is a Field Engineer at SUSE. There he focuses on Containers, Kubernetes and especially Rancher, the leading solution to manage Kubernetes clusters in multiple environments, on premise, in the cloud and at the edge.\n"
},{
  "name": "Carlos Granados",
  "slug": "carlosgranados",
  "twitter": "",
  "company": "i6 Group",
  "photo": "/images/2023/carlos-granados.jpg",
  "bio": "Been a developer my whole life, more than 30 years. Initially I developed video games and 15 years ago I moved to web applications, e-commerce and SAS. Been using PHP for more than 15 years and I am especially familiar with the Symfony framework."
},{
  "name": "Christian Rades",
  "slug": "christianrades",
  "twitter": "C_Rades",
  "company": "Shopware",
  "photo": "/images/2023/christian-rades.jpg",
  "bio": "I'm keenly interested in the ways code communicates to two different audiences at once, the computer as well as other people. This lead me to my current role in improving the development experience at Shopware.\nNext to my daily work, I'm also one of Shopware's popular Code Camps organizers, which hopes to promote a playful understanding of code in school-aged children. In my off time, I'm a programming language nerd with an interest in functional programming and distributed systems."
},{
  "name": "Ciaran McNulty",
  "slug": "ciaranmcnulty",
  "twitter": "ciaranmcnulty",
  "company": "Crania Ltd",
  "photo": "/images/2023/ciaran-mcnulty.jpg",
  "bio": "Ciaran coaches, trains and works with teams do deliver valuable software effectively."
},{
  "name": "Dave Liddament",
  "slug": "daveliddament",
  "twitter": "DaveLiddament",
  "company": "Lamp Bristol",
  "photo": "/images/2023/dave-liddament.jpg",
  "bio": "Dave is a director and developer at Lamp Bristol, a software consultancy. He’s been writing software commercially for over 20 years in many languages including C, Python, Java and PHP.\n\nDave is keen to pass on his knowledge. He speaks at conferences and user groups, and is an organiser of PHP-SW.\n\nHe is also the author of an open source tool called SARB (static analysis results baseliner) and creator of the PHP Language extension library.\n\nWhen not busy coding Dave enjoys scuba diving and running."
},{
  "name": "Derick Rethans",
  "slug": "derickrethans",
  "twitter": "derickr",
  "company": "Xdebug",
  "photo": "/images/2023/derick-rethans.jpg",
  "bio": "Derick Rethans is a PHP internals expert and author of Xdebug. He works as an independent contractor and consultant on PHP extensions and related projects.\n\nHe has contributed to the PHP project in numerous forms (Date/Time Extension, Xdebug, PHP 4.4/7.4 Release Manager, etc). He is a frequent lecturer at conferences, the author of php|architect's Guide to Date and Time Programming, and the co-author of PHP 5 Power Programming. Derick is also the host of the weekly-ish PHP Internals News podcast."
},{
  "name": "Diana Scharf",
  "handle": "dianascharf\n",
  "twitter": "DianaWebdev",
  "company": "Beyond Code",
  "photo": "/images/2023/diana-scharf.jpg",
  "bio": "Hello, I am Di!\nFullstack-Developer by day, speaker and writer by night.\n\nI am a Fullstack-Dev at Beyond Code, working with Laravel, Vue, Electron, Tailwind and whatever comes in my way. I live in the beautiful state of Bavaria in Germany - you know, where the good pretzels are coming from 🥨😍\nI can't imagine not to code since I started writing my first lines of PHP when I was eleven years old. (PHP4, oh my!) Until today, nothing has changed about this: Di ❤️ PHP!\nAway from the keyboard, I enjoy running with my dog and reading as much books as possible. :)"
},{
  "name": "Femke Buijs",
  "slug": "femkebuijs",
  "twitter": "",
  "company": "Mollie",
  "photo": "/images/2023/femke-buijs.png",
  "bio": "When Femke was young (younger), she did not know anything about programming. She was an avid PC gamer when her mother allowed her too, but was never introduced into the wonders of what was behind those fascinating interfaces. Never really knowing what she wanted to do, but having a knack for maths and economics, she chose a study in finance.\n\nWhat started off as a draining career in finance, continued as a dream job in engineering. These days she works in the FinTech industry as a PHP backend developer. When not trying to prevent systems from breaking, she is busy organising coding camps for high school kids to inspire the younger generation to choose a career in engineering, and gives motivational talks to people within and outside the developer community."
},{
  "name": "Freek Van der Herten",
  "slug": "freekvanderherten",
  "twitter": "freekmurze",
  "company": "spatie.be",
  "photo": "/images/2023/freek-van-der-herten.jpg",
  "bio": "Freek Van der Herten is a partner and developer at Spatie, an Antwerp based company that specializes in creating Laravel apps. The company has an open source first mentality. Freek is the author of many packages that Spatie releases. According to GitHub Awards Spatie is in the top 3 of PHP developers worldwide."
},{
  "name": "George Peter Banyard",
  "slug": "georgepeterbanyard",
  "twitter": "Girgias",
  "company": "",
  "photo": "/images/2023/george-peter-banyard.jpg",
  "bio": "I'm George Peter Banyard I'm a PHP Core dev currently paid part time by the PHP Foundation.\nI also maintain the PHP Documentation and lead translator for the French translation of it.\n"
},{
  "name": "Ian Littman",
  "slug": "ianlittman",
  "twitter": "iansltx",
  "company": "Covie",
  "photo": "/images/2023/ian-littman.jpg",
  "bio": "When he isn't reviewing (and sometimes writing) code as CTO at Covie or helping organize the local PHP community in Austin, Texas, Ian is probably picking the next coffee shop to work from, or opining on some facet of airline, transit, or telecommunications infrastructure.\n"
},{
  "name": "James Seconde",
  "slug": "jamesseconde",
  "twitter": "SecondeJ",
  "company": "Vonage",
  "photo": "/images/2023/james-seconde.jpg",
  "bio": "A trained actor with a curious background: from Theatre Studies, to Q/A, to Business Intelligence development, to full stack web development, I am the resident specialist PHP Developer Advocate at Global Cloud Communications giant Vonage. I founded Birmingham, UK's current PHP usergroup BrumPHP, as well as being on the Fusion Meetup team. I mentor, write and speak on PHP, Javascript, DevOps, DevRel and tech culture. I pretended to be a DJ on the way.\n"
},{
  "name": "James Titcumb",
  "slug": "jamestitcumb",
  "twitter": "asgrim",
  "company": "Roave",
  "photo": "/images/2023/james-titcumb.jpg",
  "bio": "James is a consultant, trainer and developer at Roave. He is a prolific contributor to various open source projects and is a Zend Certified Engineer. He also founded the UK based PHP Hampshire user group and PHP South Coast conference."
},{
  "name": "Joel Lord",
  "slug": "joellord",
  "twitter": "joel_lord",
  "company": "MongoDB",
  "photo": "/images/2023/joel-lord.png",
  "bio": "Joel Lord is passionate about the web and technology in general. He likes to learn new things, but most of all, he wants to share his discoveries. He does so by travelling at various conferences all across the globe.\nHe graduated from college in computer programming in the last millennium. Apart from a little break to get his BSc in computational astrophysics, he was always in the industry.\nIn his daily job, Joel is a developer advocate with MongoDB, where he connects with software engineers to help them make the web better by using best practices around JavaScript.\nDuring his free time, he can be found stargazing on a campground somewhere or brewing a fresh batch of beer in his garage."
},{
  "name": "Keren Kenzi",
  "slug": "kerenkenzi",
  "twitter": "KerenKenzi",
  "company": "",
  "photo": "/images/2023/keren-kenzi.jpg",
  "bio": "Keren has been working as a software engineer for more than a decade. She has a M.Sc. in Computer Science and loves React and learning new technologies. Keren volunteers as a program manager at Baot, a community that helps women in R&D in their professional growth. She co-organizes meetups and gives workshops on tech blogging. And in her not-so-spare time, she studies psychology. Her hobbies include drawing, photography, and singing."
},{
  "name": "Marcel Pociot",
  "slug": "marcelpociot",
  "twitter": "marcelpociot",
  "company": "Beyond Code",
  "photo": "/images/2023/marcel-pociot.jpg",
  "bio": "Marcel Pociot is CTO at Beyond Code, where he works on improving developers life’s through tools such as Tinkerwell, Invoker, HELO and more.\n"
},{
  "name": "Mark Bradley",
  "slug": "markbradley",
  "twitter": "braddle",
  "company": "Armakuni",
  "photo": "/images/2023/mark-bradley.jpg",
  "bio": "London based Mark Bradley works as a Senior Consulting Engineer for Armakuni, helping companies adopt Cloud Native technologies, practises and principles. Working in the industry for over 10 years, Mark has developed a passion and a wealth of knowledge in how to support software teams to be elite functions. He honed these skills during previous roles mentoring peers and leading apprentice programmes, alongside his day job.\n\nA keen protagonist of Test Driven Development, he launched his own screen cast, <a target=\"blank\" href=\"https://www.youtube.com/c/TestingAllTheThings/\">TestingAllTheThings</a> in May 2019, to help the wider community learn how to practice Test Driven Development and Automated Testing.\n\nMark is a keen cyclist, who enjoys quiet evenings in the pub playing board games and spending time with his wife and three children.."
},{
  "name": "Mark Niebergall",
  "slug": "markniebergall",
  "twitter": "mbniebergall",
  "company": "",
  "photo": "/images/2023/mark-niebergall.jpg",
  "bio": "Mark Niebergall is a security-minded PHP senior software engineer at a cybersecurity software company, with many years of hands-on experience with PHP projects. He is the Utah PHP User Group Co-Organizer, a regular conference speaker, and an occasional author. Mark has a Masters degree in MIS, is CSSLP and SSCP cybersecurity certified, and volunteers for (ISC)2 security exam development. Mark enjoys endurance sports, being outdoors, and teaching his five boys how to push buttons and use technology."
},{
  "name": "Marine Gandy",
  "slug": "marinegandy",
  "twitter": "mupsigraphy",
  "company": "Platform.sh",
  "photo": "/images/2023/marine-gandy.jpg",
  "bio": "After completing a degree in English Language, Literature and Civilization, Marine decided to change careers and pursue web development.\n\nShe discovered Drupal right when she began working as a PHP developer in 2015, and has since gotten more and more involved in the community.\n\nShe is currently the president of the French Drupal Association and a DevRel Engineer at Platform.sh."
},{
  "name": "Mike Lehan",
  "slug": "mikelehan",
  "twitter": "m1ke",
  "company": "",
  "photo": "/images/2023/mike-lehan.jpg",
  "bio": "Mike has been working in web application development using PHP for 13 years, including time as a CTO and startup founder. Through working on business critical systems with real time elements Mike has learned the value of comprehensive logging & monitoring, redundant checks on applications & infrastructure, and of course well written testable code. He has a strong desire to train & mentor the next generation of web engineers.."
},{
  "name": "Naomi Gotts",
  "slug": "naomigotts",
  "twitter": "naomigo",
  "company": "Tillo",
  "photo": "/images/2023/naomi-gotts.jpg",
  "bio": "Naomi is a Senior Software Engineer and has been working with PHP professionally for over 15 years. Alongside a passion for Test Driven Development, helping others to learn via means such as mentoring, book clubs and internal tech conferences, writing code is still very close to her heart. Outside of work, Naomi is a big F1 fan and is likely never far from a crochet hook, especially in winter time!"
},{
  "name": "Nuno Maduro",
  "slug": "nunomaduro",
  "twitter": "enunomaduro",
  "company": "",
  "photo": "/images/2023/nuno-maduro.jpg",
  "bio": "Nuno Maduro is a Speaker, Laravel Core Team Member, Open Source Developer.Nuno has created dozens of popular open-source projects, including Laravel Zero, Collision, Larastan, PHP Insights, Termwind, and the second most used PHP Testing Framework in the world: PEST. All these packages combined have been downloaded more than 200 million times. Nuno has a very close relationship with the Laravel community, the most popular PHP framework in the world. As a core team member, Nuno has developed and maintained multiple Laravel projects and features that are being used by companies over the world. Including The New York Times, Disney, Twitch, and more."
},{
  "name": "Paul Dragoonis",
  "slug": "pauldragoonis",
  "twitter": "dr4goonis",
  "company": "Dragoonis Technologies",
  "photo": "/images/2023/paul-dragoonis.jpg",
  "bio": "My name is Paul, and I'm from Glasgow, Scotland. I'm an open-source contributor, public speaker, trainer, and consultant by trade. I'm a member of the CD Foundation, PHP, PHP-FIG, and Jenkins projects/teams. In my career, I've held positions such as Director of Engineering, CTO, Principal Engineer/Architect, and so on. I've spent many years modernizing CI/CD pipelines and embedding continuous delivery processes and solutions into businesses. I enjoy sharing my experience in the space with the wider community by way of private training or conference speaking."
},{
  "name": "Pauline Vos",
  "slug": "paulinevos",
  "twitter": "vanamerongen",
  "company": "Instapro",
  "photo": "/images/2023/pauline-vos.jpg",
  "bio": "Pauline is a PHP developer currently employed by HomeAdvisor Intl. in Amsterdam. She likes good, clean software design and being as efficient (lazy) as possible. Also cocktails, video games and animal memes. She lives in Amsterdam with her cat, Phife Cat, and about three plants."
},{
  "name": "Rick Kuipers",
  "slug": "rickkuipers",
  "twitter": "rskuiper",
  "company": "WeDevelop",
  "photo": "/images/2023/rick-kuipers.jpg",
  "bio": "As a developer I've always been more interested in the process rather than the outcome. I'm intrigued by team dynamics, communication and agile coding. I've worked in small and large teams and explored many different aspects of software development. As CTO of WeDevelop I aim to create the best possible landscape for software development, helping people thrive and develop stories that matter."
},{
  "name": "Rain Leander",
  "slug": "rainleander",
  "twitter": "",
  "company": "Temporal Technologies",
  "photo": "/images/2023/rain-leander.jpeg",
  "bio": "Rain Leander is a systematic, slightly psychic, interdisciplinary community liaison with a Bachelor’s in dance and a Master’s in IT. An epic public speaker, they have disappeared within a box stuffed with swords, created life, and went skydiving with the Queen. Seriously. Rain is an active technical contributor with Temporal, CockroachDB, Tinkerbell, OpenStack, RDO, TripleO, Fedora, and DjangoGirls. Come say hello. Bring cake."
},{
  "name": "Rob Allen",
  "slug": "roballen",
  "twitter": "akrabat",
  "company": "19FT",
  "photo": "/images/2023/rob-allen.jpg",
  "bio": "Rob Allen is a software developer with many years experience in a variety of interesting languages. He's particularly interested in APIs and the ecosystem around them along and contributes to Slim Framework, rst2pdf & Apache OpenWhisk along with other open source projects. Rob is a published author and based in the UK & works as VP of Engineering at Covie. In his spare time, Rob blogs at <a target=\"blank\" href=\"https://akrabat.com\">akrabat.com</a> and can often be seen with a camera in his hand."
},{
  "name": "Tim Bond",
  "slug": "timbond",
  "twitter": "TimB0nd",
  "company": "McGraw Hill",
  "photo": "/images/2023/tim-bond.jpg",
  "bio": "Tim is a senior full stack developer that got his start with PHP 15 years ago. He is a sticker for good Git commits and is the author of multiple mobile apps and is very active in the Tabris.js community. When not in front of a computer, you'll probably find him hiking or biking around beautiful Seattle, or putting together a new Lego set on one of the rare rainy days.\n"
},{
  "name": "Timo Michna",
  "slug": "timomichna",
  "twitter": "",
  "company": "Quentic",
  "photo": "/images/2023/timo-michna.png",
  "bio": "Timo is a software developer with over 20 years experience in frontend and backend development in a variety of industries and project types. He is currently employed as an software architect in his hometown Berlin. In his free time (besides many other thing) he is a maintainer for CNCF's OpenTelemetry project for PHP language implementations.\n"
}]
