{
  "sponsors": [
    {
      "name": "Platform.sh",
      "id": "platform",
      "type": "track",
      "url": "https://platform.sh/",
      "description": "Platform.sh is a unified, secure, enterprise-grade platform for building, running and scaling websites and online applications. We’re the leader in digital infrastructure management with everything you need to manage your websites and applications available from the moment you join us. With your infrastructure and workflows handled from the start, your websites and applications work seamlessly. Allowing your team to focus on what really matters: making changes faster, collaborating with confidence, and scaling responsibly. Whether you’re managing 10 or 10,000 websites or applications, Platform.sh is the developer’s choice for a solution that scales right.",
      "logo": {
        "url": "/images/sponsors/platform.png",
        "alt": "Platform.sh logo"
      }
    },
    {
      "name": "Copia Digital",
      "id": "copiadigital",
      "type": "gold",
      "url": "https://www.copiadigital.com/",
      "description": "Copia is a digital communications agency for companies in the capital markets, helping them communicate effectively with their investors and stakeholders. We’ve been building brands for asset managers and public companies for more than a decade, producing websites, corporate identities and acting as a trusted partner to dozens of companies. Our work helps companies engage and educate their investors across digital and print media, bringing creativity to stakeholder communications.\nOur forte is producing enterprise WordPress websites, building highly optimised and ultra-secure sites for FTSE clients who want to tell their investment cases.",
      "logo": {
        "url": "/images/sponsors/copia.svg",
        "alt": "Copia Digital logo"
      }
    },
    {
      "name": "LexisNexis Risk Solutions",
      "id": "lexisnexisrisk",
      "type": "gold",
      "url": "https://risk.lexisnexis.co.uk/?geo=1",
      "description": "LexisNexis® Risk Solutions provides data and analytics tools that assist businesses in evaluating and\npredicting risk and enhancing operational efﬁciency.\nWe help our customers make better, timelier decisions and assist them in managing risks like\nidentity theft, fraud, money laundering and terrorism, and preventing ﬁnancial crimes, and\ninsurance and government beneﬁt scams.\nHarnessing the power of data, we can help those without traditional credit histories obtain access to\nfunds, assist agencies in ﬁnding uncollected revenue, and help law enforcement to solve crimes.\nBy bringing clarity to information, we ultimately help make communities safer, insurance rates more\naccurate, commerce more transparent, business decisions easier and processes more efﬁcient.",
      "logo": {
        "url": "/images/sponsors/lexisnexis.png",
        "alt": "Lexis Nexis logo"
      }
    },
    {
      "name": "SensioLabs",
      "id": "sensiolabs",
      "type": "gold",
      "url": "https://sensiolabs.com/",
      "description": "SensioLabs has created the Open-Source PHP framework Symfony, which has become a global reference in web development. SensioLabs supports companies that have selected PHP and Symfony as the cornerstone of their development. With an offering encompassing consultancy, expertise, services, training, and support, SensioLabs enhances developers' effectiveness and ensures the success of web applications development projects.",
      "logo": {
        "url": "/images/sponsors/sensiolabs.svg",
        "alt": "Sensio Labs logo"
      }
    },
    {
      "name": "Dragoonis Technologies",
      "id": "dragoonistechnologies",
      "type": "silver",
      "url": "https://www.dragoonis.com/",
      "description": "Dragoonis Technologies is the evolution of tech hiring; we apply software engineering processes into the recruitment sector, taking the guesswork out of hiring. We use industry expert engineers with experience of hiring and building teams, to technically screen the highest level of specialists. This means we can make sure that every specialist you get from us is of the highest quality and can do the job just as you need it. With our solution, time to source, screen, and hire are notably reduced. Saving your business time, and most importantly money.",
      "logo": {
        "url": "/images/sponsors/dragoonis.png",
        "alt": "Dragoonis Technologies logo"
      }
    }]
}