{
	"sponsors": [{
		"name": "Shopware",
		"id": "shopware",
		"type": "platinum",
		"url": "https://www.shopware.co.uk/community/developers/",
		"description": "Shopware is a leading ecommerce system and used by some of the largest European brands, retailers and manufacturers across B2C and B2B industries. As a trendsetting open source solution, Shopware gives retailers the freedom to quickly and easily realise their growth potential - with more flexibility and less complexity. Today, more than 100,000 companies rely on a Shopware solution, with all retailers - from start-ups to enterprise - generating a combined turnover of 5.8 billion euros in 2018. From its headquarters in Schöppingen, Germany, Shopware employs 200 people and relies on a global network of 1,200 sales, technology and solution partners. A community with hundreds of thousands of members gives customers access to over 3,500 extensions and certified professional support. 100% equity-financed, Shopware is completely independent; and through high investments in research and development, is the leading driver of innovation in European ecommerce.",
		"logo": {
			"url": "/images/sponsors/shopware.png",
			"alt": "Shopware logo"
		}
	}, {
		"name": "Twilio",
		"id": "twilio",
		"type": "gold",
		"url": "https://www.twilio.com/",
		"description": "Twilio powers the future of business communications. Enabling phones, VoIP, and messaging to be embedded into web, desktop, and mobile software. Millions of developers around the world have used Twilio to unlock the magic of communications to improve any human experience. Twilio has democratized communications channels like voice, text, chat, video, and email by virtualizing the world’s communications infrastructure through APIs that are simple enough for any developer to use, yet robust enough to power the world’s most demanding applications. By making communications a part of every software developer’s toolkit, Twilio is enabling innovators across every industry — from emerging leaders to the world’s largest organizations — to reinvent how companies engage with their customers.",
		"logo": {
			"url": "/images/sponsors/twilio.png",
			"alt": "Twilio logo"
		}
	}, {
		"name": "RIPS Technologies",
		"id": "ripstech",
		"type": "gold",
		"url": "https://www.ripstech.com/",
		"description": "RIPS Technologies delivers automated security analysis for web applications as platform independent software or highly scalable cloud service. With our unique approach, even complex security vulnerabilities are detected that no other solution can detect. Detailed patch instructions allow remediating security risks time- and cost-efficiently, before these are exposed to attackers.",
		"logo": {
			"url": "/images/sponsors/ripstech.png",
			"alt": "Ripstech logo"
		}
	}, {
		"name": "Ticket Tailor",
		"id": "tickettailor",
		"type": "gold",
		"url": "https://www.tickettailor.com/",
		"description": "Ticket Tailor is a start-up with a difference. We're the world’s #1 independent ticketing platform and we’re on a mission to scale in our own way: sustainably and soulfully. That means:<ul><li>point one</li> we've bootstrapped the company from day one and we're profitable<li>point two</li> we don't have VCs who demand us to grow 10x every 48 hours<li>point three</li> we care about the people we work with, our customers and the community we're based in</ul> We’re on the lookout for talented PHP developers. If you’re interested in working with PHP microframeworks, scaling, testing, writing clean code come and chat with us! <a href=\"https://www.tickettailor.com/careers/\">https://www.tickettailor.com/careers/</a>",
		"logo": {
			"url": "/images/sponsors/tickettailor.png",
			"alt": "Ticket Tailor logo"
		}
	}, {
		"name": "Nexmo",
		"id": "nexmo",
		"type": "gold",
		"url": "https://www.nexmo.com/",
		"description": "Nexmo is a global cloud communications platform, providing APIs and SDKs for messaging, voice, phone verification, advanced multi-channel conversations and video calling with the OpenTok API. We have officially supported open source libraries for Python, PHP, Ruby, Node.JS, Java and C# .NET enabling you to build scalable communications features such as two-factor authentication, notifications, two-way and group messaging, one to one or multi person calls, all with the technologies that you are already using. With our new Messages and Dispatch you can now integrate with various communication channels including Facebook Messenger, WhatsApp and Viber.",
		"logo": {
			"url": "/images/sponsors/nexmo.png",
			"alt": "Nexmo logo"
		}
	}, {
		"name": "LexisNexis Risk Solutions",
		"id": "lexisnexis",
		"type": "gold",
		"url": "https://risk.lexisnexis.co.uk/",
		"description": "At LexisNexis Risk Solutions, we believe in the power of data and advanced analytics for better risk management. With over 40 years of expertise, we are the trusted data analytics provider for organisations seeking actionable insights to manage risks and improve results while upholding the highest standards for security and privacy. LexisNexis is part of RELX Group plc, a FTSE 100 and world-leading provider of information solutions for professional customers. You can learn more about us at our website - https://risk.lexisnexis.co.uk/",
		"logo": {
			"url": "/images/sponsors/lexisnexis.png",
			"alt": "lexisnexis logo"
		}
	}, {
		"name": "Zend By Perforce",
		"id": "perforce",
		"type": "gold",
		"url": "https://www.zend.com",
		"description": "Zend by Perforce provides the long-term support, tools, training, certification, and services that organizations need to deliver highly available and flexible enterprise PHP and Laminas solutions.",
		"logo": {
			"url": "/images/sponsors/perforce.png",
			"alt": "perforce logo"
		}
	}, {
		"name": "WebsiteSetup.org",
		"id": "websitesetup",
		"type": "silver",
		"url": "https://www.websitesetup.org/",
		"description": "Free resources for beginners to create and maintain websites.",
		"logo": {
			"url": "/images/sponsors/websitesetup.png",
			"alt": "Website Setup.org Logo"
		}
	}]
}
